<a href="https://colab.research.google.com/github/Pasupureddy-Sumanth0628/Question-Bank-Management-System/blob/main/Pandas_series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
l=['Ram','Sam','Geeta','Hari','Ramesh']
ul=pd.Series(l)
ul

0       Ram
1       Sam
2     Geeta
3      Hari
4    Ramesh
dtype: object

In [4]:
index=['Sunday','Monday','Tuesday','Wednesday','Thursday']
ul=pd.Series(l,index)
ul

Sunday          Ram
Monday          Sam
Tuesday       Geeta
Wednesday      Hari
Thursday     Ramesh
dtype: object

In [6]:
#holding data in the form of key values pairs
d={1:"hii",2:"Hello",3:"How are you"}
ul=pd.Series(d)
ul

1            hii
2          Hello
3    How are you
dtype: object